load_test/wrk_op.txt
Running 1m test @ http://localhost:8080
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    51.11ms   34.12ms 495.45ms   92.65%
    Req/Sec   722.36    176.66     2.44k    88.62%
  Latency Distribution
     50%   41.62ms
     75%   48.55ms
     90%   68.50ms
     99%  216.35ms
  517341 requests in 1.00m, 80.48MB read
Requests/sec:   8609.06
Transfer/sec:      1.34MB

With Redis

Running 1m test @ http://localhost:8080
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    23.41ms   29.66ms 495.06ms   94.86%
    Req/Sec     1.82k   696.83     5.79k    75.96%
  Latency Distribution
     50%   15.06ms
     75%   17.71ms
     90%   44.72ms
     99%  176.23ms
  1311444 requests in 1.00m, 204.03MB read
Requests/sec:  21819.65
Transfer/sec:      3.39MB

With Redis + Virtual Threads

Running 1m test @ http://localhost:8080
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    30.82ms   45.51ms 822.35ms   90.60%
    Req/Sec     1.84k     1.70k   23.52k    93.88%
  Latency Distribution
     50%   14.40ms
     75%   21.78ms
     90%   71.94ms
     99%  241.53ms
  1338450 requests in 1.00m, 208.23MB read
Requests/sec:  22272.30
Transfer/sec:      3.47MB